app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
	def index
	  @event = Event.all

SELECT "events".* FROM "events" WHERE (start_date < '2019-07-11 03:23:42.275431')
SELECT "events".* FROM "events" WHERE (start_date < '2019-07-11 03:28:47.850265') AND (start_date > '2019-04-12 03:28:47.851029')
---
	def upcoming
			event = Event.where('start_date < ?', DateTime.now+90)
			@event = event.where('start_date > ?', DateTime.now)