app/controllers/event_venues_controller.rb

	def index
	  @event_venue = Event_venue.all
---
SELECT "event_venues".* FROM "event_venues"