app/controllers/orders_controller.rb

	def most
		mostt=Order.select([:user_id, Order.arel_table[:id].count.as('totalTickets')]).order(:TotalTickets).reverse_order.group(:user_id).limit(1)
		cant=mostt[0].totalTickets
		id=mostt[0].user_id
		@topUser=User.find(id)
---
SELECT  "orders"."user_id", COUNT("orders"."id") AS TotalTickets FROM "orders" GROUP BY "orders"."user_id" ORDER BY "TotalTickets" DESC LIMIT ?  [["LIMIT", 1]]
SELECT COUNT("orders"."user_id") AS count_user_id, "orders"."user_id" AS orders_user_id FROM "orders" GROUP BY "orders"."user_id"
SELECT COUNT(*) FROM "tickets"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]