app/controllers/ticket_types_controller.rb

	def index
	  @ticket_type = TicketType.all
---
SELECT "ticket_types".* FROM "ticket_types"

	def show
	  @ticket_type = TicketType.find_by(id: params[:id])
---
SELECT  "ticket_types".* FROM "ticket_types" WHERE "ticket_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def join
		@jointable = Ticket.where("ticket_type_id=?",params[:id])
---
SELECT "tickets".* FROM "tickets" WHERE (ticket_type_id='1')