app/controllers/tickets_controller.rb

SELECT "tickets".* FROM "tickets"
---
	def index
	  @ticket = Ticket.all

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
	  @ticket = Ticket.find_by(id: params[:id])

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def destroy
		session[:ticket_id] = nil
    @ticket = Ticket.find(params[:id])