app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-04-11 06:46:48.794636"], ["updated_at", "2019-04-11 06:46:48.794636"]]
---
	def create
		@user = User.create(:name => params[:name], :lastname => params[:lastname], :email => params[:email], :password => params[:password], :address => params[:address])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
		@user = User.find_by(id: params[:id])